/**
  ******************************************************************************
  * @file			screen.h
  * @brief		菜单所用显示函数
  * @version	0.1
  * @date			Aug 25, 2021
  ******************************************************************************
  * @attention	
  *						菜单刷新所使用函数，功能已经写明，若使用不同的屏幕或驱动
							则根据需要修改
  ******************************************************************************
  */
	

/**
	* @brief 	向屏幕上添加内容
  * @param	text: 文本内容
	* @param	x,y:屏幕坐标
  */
void AddScreen(char* text,int x,int y);


/**
	* @brief 	向屏幕上添加反色内容
  * @param	text: 文本内容
	* @param	x,y:屏幕坐标
  */
void AddScreenR(char* text,int x,int y);

/**
	* @brief 	清屏
  */
void ClearScreen(void);